Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: A trivial password, such as "password" or your name is easy to guess, and negates the security that Password Safe provides.
ru_ru: Простой пароль, такой как «пароль» или ваше имя, легко подбирается и сводит на нет защиту, обеспечиваемую Password Safe.

source: A variable may be followed by a numerical value within square brackets is called an 'Index value'.
ru_ru: После переменной может указываться числовое значение в квадратных скобках, называемое «индексом».

source: A" and "Dept.
ru_ru: A» и «Отдел

source: A:LDAP Server:Joe]"
ru_ru: A:Сервер:Вася]».

source: A:LDAP Server]".
ru_ru: A:Сервер]».

source: About Password Safe
ru_ru: О Password Safe

source: Accelerators
ru_ru: Горячие клавиши

source: Add Entry
ru_ru: Добавить элемент

source: Add Group
ru_ru: Добавить группу

source: Add Password Entries
ru_ru: Добавление элементов

source: Add a New Group
ru_ru: Добавление новой группы

source: Add a New Group via Tree View
ru_ru: Добавление новой группы в древовидном списке

source: Add a New Named Password Policy
ru_ru: Добавление новой именованной политики

source: Add a named password policies dialog
ru_ru: Диалог добавления новой именованной политики

source: Add a new user name and password.
ru_ru: Добавление нового имени и пароля.

source: Add/Edit entry and the Generate Password functions
ru_ru: Редактирование/просмотр элемента и функция создания паролей

source: Add/Edit font size in tenths of a point
ru_ru: Размер шрифта в диалоге вставки/редактирования в десятых долях пункта

source: Adding YubiKey Authentication
ru_ru: Добавление аутентификации при помощи YubiKey

source: Adding/Removing/Changing Password Authentication
ru_ru: Добавление/удаление/изменение мастер-пароля

source: Additional
ru_ru: Дополнительно

source: Additional notes on entry keyboard shortcuts:
ru_ru: Особенности работы с горячими клавишами:

source: Adds a new group to the open safe.
ru_ru: Добавить новую группу в текущий контейнер

source: Adds a new user ID and password entry to the open safe.
ru_ru: Создать новый элемент в текущем контейнере

source: Advanced Search
ru_ru: Расширенный поиск

source: Advanced Text Export Options
ru_ru: Расширенные настройки экспорта а в простой текст

source: Advanced Text Export dialog box
ru_ru: Расширенные настройки экспорта в простой текст

source: Advanced XML Export Options
ru_ru: Расширенные настройки экспорта в XML

source: Advanced field selection criteria
ru_ru: Расширенные условия отбора

source: After changing the language, all menus, dialogs and messages will now be in your chosen language.
ru_ru: После изменения языка все меню, диалоги и сообщения будут отображаться на выбранном языке.

source: After clicking Edit Base entry you can edit the corresponding base entry to this shortcut or alias.
ru_ru: После нажатия Редактировать исходный элемент вы сможете произвести изменения в соответствующем исходном для выбранного ярлыка или псевдонима элементе.

source: After clicking Go to Base entry the corresponding base entry will be selected.
ru_ru: После выбора пункта Перейти к исходному элементу происходит переход к соответствующему исходному элементу.

source: After comparing two databases, if they are not identical, a Compare Results dialog is displayed.
ru_ru: Если при сравнении окажется, что данные в контейнерах не совпадают, будет выведено окно с результатами.

source: After opening, the current status will be shown in the Status Bar at the bottom of the Password Safe window.
ru_ru: После открытия контейнера текущий статус отображается в строке состояния.

source: After selecting a database, this database will be checked for being completely compatible to PassowrdSafe.
ru_ru: Указанный контейнер будет проверен на совместимость с текущей версией Password Safe.

source: After selecting a database, this database will be checked for being completely compatible to Password Safe.
ru_ru: Указанный контейнер будет проверен на совместимость с текущей версией Password Safe.

source: After selecting a policy, its details will be shown below.
ru_ru: После выбора политики её параметры отображаются внизу.

source: After the two databases are compared, if there are any differences detected, the above dialog is shown.
ru_ru: Если при сравнении контейнеров обнаруживаются отличия, выводится окно с результатами.

source: After version 3.42.1, the preference element is augmented with XML attributes that are used to set the virtual key code and modifier flags (e.g., Ctrl="1" Key="30") to the internal Password Safe format that can be used across other platforms.
ru_ru: После версии 3.42.1 в элемент были добавлены атрибуты для указания кода клавиши и флагов модификаторов (например, Ctrl="1" Key="30") во внутреннем формате Password Safe, который может использоваться на разных платформах.

source: Afterwards, you will be prompted to enter a master password that is used to encrypt and lock the contents of your new safe.
ru_ru: Затем нужно ввести мастер-пароль, который будет использован для шифрования контейнера.

source: Alias
ru_ru: Псевдоним

source: Alias Base Entry
ru_ru: Исходный элемент для псевдонима

source: Alias entries are shown with grey triangles.
ru_ru: Псевдонимы помечены серыми треугольниками.

source: Alias entries are shown with white triangles.
ru_ru: Псевдонимы помечены белыми треугольниками.

source: Alias example
ru_ru: Пример псевдонима

source: Aliases
ru_ru: Псевдонимы

source: Aliasing Passwords
ru_ru: Псевдонимы для паролей

source: All 'carriage return' characters are removed from the Notes field and all 'newline' characters are converted to the normal Password Safe delimiter '»' used to denote new lines within the Notes field.
ru_ru: Из поля заметок удаляются все символы возврата каретки, а символы новой строки преобразуются в используемый Password Safe разделитель строк '»'.

source: All entries with a username "Joe" (exactly) created after May 1st 2008
ru_ru: Все элементы, с именем пользователя «Вася» (точное совпадение), созданные после 1 мая 2008 года

source: All entries with a username containing "joe" or "Joe" or "JOE":
ru_ru: Все элементы, с именем пользователя «вася», «Вася» или «ВАСЯ»

source: All entries with a username containing "joe" or "mary"
ru_ru: Все элементы, с именем пользователя, содержащим «Вася» или «Маша»

source: All functionality is described in the previous section.
ru_ru: Все функции описаны в предыдущем разделе.

source: All functions in the Edit menu can also be reached by clicking the right mouse button on the corresponding entry, alias or group.
ru_ru: Все функции меню Правка доступны через контекстное меню (при нажатии правой кнопкой мыши) элемента, псевдонима или группы.

source: All input and output files are in the same directory as the XSLT processor.
ru_ru: Все входные или выходные файлы находятся в том же каталоге, что и XSLT-процессор.

source: All other brand or product names are trademarks of their respective companies.
ru_ru: Все другие торговые марки и названия продуктов являются товарными знаками соответствующих компаний.

source: All other dialogs, message boxes and menus will always be fully opaque.
ru_ru: Все диалоги, окна с сообщениями и меню остаются непрозрачными.

source: All other fields in this section are ignored.
ru_ru: Оставшиеся поля из этого раздела игнорируются.

source: All other saved changed fields in the KeePass XML element are ignored.
ru_ru: Все остальные изменения, сохранённые в записях истории KeePass, игнорируются.

source: All other tags from <History>
ru_ru: Все остальные значения из <History>

source: All other text is typed as-is.
ru_ru: Все другие символы переносятся без изменений.

source: All others
ru_ru: Все остальные

source: All these are saved in database header and so are database specific.
ru_ru: Все настройки политик сохраняются в заголовке контейнера и поэтому привязаны к нему.

source: All these programs are free, although Kernow needs to be registered if used more than 100 times.
ru_ru: Все перечисленные программы бесплатны для использования, но Kernow требует регистрации после стократного использования.

source: Allow multiple instances (requires all instances to be restarted)
ru_ru: Разрешить одновременный запуск нескольких копий (для применения требуется перезапуск всех копий программы)

source: Allow multiple instances of password Safe to be started.
ru_ru: Разрешить одновременный запуск нескольких копий Password Safe

source: Also by default, passwords are obscured when editing the entry.
ru_ru: При редактировании пароль по умолчанию скрыт.

source: Also, please see above on possible issues when using the '\z' field.
ru_ru: Обратите внимание на возможные побочные эффекты использования последовательности «\z».

source: Also, some items may be disabled, as noted below.
ru_ru: Кроме того, как указано ниже, некоторые элементы могут быть недоступны.

source: Also, you cannot delete a named policy that is being used by at least one entry in the database.
ru_ru: Политика, которая используется хотя бы одним элементом не может быть удалена.

source: Alt key
ru_ru: Клавиша Alt

source: Alternate Browser
ru_ru: Альтернативный браузер

source: Alternate browser
ru_ru: Альтернативный браузер

source: Alternately, you can type in the path to the database to open, or select it from a File dialog box by pressing on the ellipsis ("...") button.
ru_ru: Также можно ввести путь к файлу контейнера или выбрать его, нажав на кнопку «...».

source: Although this may sound complicated, in fact it's quite simple and intuitive to use.
ru_ru: На первый взгляд это может показаться сложным, но, на самом деле, всё достаточно просто и понятно.

source: Although we have a solution for this (we send a Tab followed by a Shift+Tab to return to the selected window only when using this Dragbar AutoType image), the side-effect is that you can only use the Dragbar AutoType image to replace any existing string in that window by the expanded AutoType string.
ru_ru: Поэтому только при автонаборе с панели «Dragbar» сначала посылается символ табуляции, а затем Shift+Tab (чтобы обратно вернуться в поле ввода). Побочный эффект этого трюка приводит к тому, что автонабор с панели «Dragbar» заменяет значение поля, а не добавляет ввод к нему.

source: Although we have a solution for this (we send a Tab followed by a Shift+Tab to return to the selected window only when using this Dragbar Autotype image), the side-effect is that you can only use the Dragbar Autotype image to replace any existing string in that window by the expanded Autotype string.
ru_ru: Поэтому только при автонаборе с панели «Dragbar» сначала посылается символ табуляции, а затем Shift+Tab (чтобы обратно вернуться в поле ввода). Побочный эффект этого трюка приводит к тому, что автонабор с панели «Dragbar» заменяет значение поля, а не добавляет ввод к нему.

source: Although, all dependants will be on the new submenu, some may be disabled if, for example, a filter is active and the entry is not visible or if there are more than the maximum of 25 dependants that can be referenced by this function.
ru_ru: Всё подчинённые элементы будут перечислены в указанном подменю, но некоторые из них могут быть недоступны, например, если активен фильтр и они не соответствуют условиям отбора, или если их более 25 (максимум для данного функционала).

source: Although, this could have been changed to be any other valid shortcut, the use of the Enter key for this function would still be active as it is a function of the Tree View.
ru_ru: Несмотря на то, что на данное действие можно было бы назначить другую комбинацию клавиш, сворачивание/разворачивание ветви всё равно происходило бы и по нажатию клавиши Enter, так как это системная комбинация для древовидного списка.

source: Although, this could have been changed to be any other valid shortcut, the use of the Enter key for this would still be active as it is a function of the Tree View.
ru_ru: Несмотря на то, что на данное действие можно было бы назначить другую комбинацию клавиш, сворачивание/разворачивание ветви всё равно происходило бы и по нажатию клавиши Enter, так как это системная комбинация для древовидного списка.

source: AltovaXML Community Edition (current version 2011r3).
ru_ru: AltovaXML Community Edition (текущая версия 2011r3).

source: Always keep Password Safe on top
ru_ru: Располагать Password Safe поверх всех окон

source: An ID can only be assigned to an opened database.
ru_ru: Идентификатор может быть назначен только открытому контейнеру.

source: An ID is reserved once assigned to an open database but will be free to be used again either when a new ID is assigned or the database is closed.
ru_ru: Идентификатор бронируется после его назначения открытому контейнеру, но освобождается и становится доступным к назначению сразу после закрытия контейнера, которому он был назначен.

source: An entry keyboard shortcut must include the Alt or Ctrl key (with or without the Shift key).
ru_ru: Комбинация клавиш для элемента должна содержать хотя бы один из модификаторов Alt и Ctrl (с или без Shift).

source: An entry's 'Run Command' field can contain a command that will be run when the Run Command action is selected.
ru_ru: В поле «Выполнить» можно указать команду, выполняемую при выборе действия «Выполнить команду».

source: An entry's password history is accessible via the "Additional" tab button in the Edit Entry dialog box.
ru_ru: История изменения паролей доступна на вкладке «Дополнительно» диалога редактирования элемента.

source: And with its intuitive interface you will be up and running in minutes.
ru_ru: Благодаря интуитивно-понятному интерфейсу вы разберётесь в программе за несколько минут.

source: Another thing you might want to consider is arranging for access to your password database by relatives or co-workers if you are no longer able to do so.
ru_ru: Кроме того, может возникнуть необходимость в предоставлении доступа к сохранённым паролям родственникам или коллегам.

source: Any changes made to this policy whilst viewing will not be saved.
ru_ru: Любые изменения, произведённые во время просмотра, не будут сохранены.

# Any end of line characters ' ', '' or ' ' are converted to '' (carriage return).
source: Any end of line characters '\n', '\r' or '\r\n' are converted to '\r' (carriage return).
ru_ru: символы конца строки «\n», «\r» или «\r\n» преобразуются в «\r» (возврат каретки);

# Any end of line characters ‘ ’, ‘’ or ‘ ’ are converted to ‘’ (carriage return).
source: Any end of line characters ‘\n’, ‘\r’ or ‘\r\n’ are converted to ‘\r’ (carriage return).
ru_ru: символы конца строки «\n», «\r» или «\r\n» преобразуются в «\r» (возврат каретки);

source: Any entry created via "Duplicate Group" or "Duplicate Entry" actions.
ru_ru: Элементы был создан посредством дублирования группы или элемента.

source: Any field containing a blank will be output inside double quotation characters.
ru_ru: Любое значение, содержащее пробел, будет заключено в двойные кавычки.

source: Any key combination that you select will be defined as the shortcut for this action.
ru_ru: Выбранная комбинация клавиш будет назначена для вызова данного действия.

source: Any time later than this is currently treated as invalid and that the associated field is unset.
ru_ru: Более поздние даты считаются некорректными, и соответствующие поля не заполняются.

source: Any time later than this is currently treated as invalid and the associated field is unset.
ru_ru: Более поздние даты считаются некорректными, и соответствующие поля не заполняются.

source: Any trailing CR and/or LF are removed from single lines selected from the Notes field.
ru_ru: При указании одиночных строк заметок конечные символы CR и/или LF отбрасываются.

source: Any unknown environment variable is left unchanged in the Run Command e.g., %xyz%\notepad.exe remains as %xyz%\notepad.exe if variable 'xyz' is not set.
ru_ru: Имена неопознанных переменных окружения остаются без изменений. Например, "%xyz%\notepad.exe" останется равным "%xyz%\notepad.exe", если переменная окружения «xyz» не определена.

source: Anything that you can do in Windows' "Start → Run" can be used here.
ru_ru: Можно указать любую команду, которая может быть выполнена в ОС Windows через меню «Пуск→Выполнить».

source: Appendices
ru_ru: Приложения

source: Application Hot Key
ru_ru: Горячая клавиша для вызова программы

source: Application related preferences stored within the Configuration file (pwsafe.cfg)
ru_ru: Связанные с приложением настройки (хранятся в файле pwsafe.cfg)

source: Application related:
ru_ru: Связанные с приложением:

source: Applying a Filter
ru_ru: Применение фильтра

source: As all filters, they can be cleared by double-clicking the red and white striped "filter active" indicator at the bottom right of the Status Bar, as can be seen in the following images where the filter is active.
ru_ru: Как и любые другие фильтры, они могут быть сброшены двойным щелчком по индикатору активного фильтра (заштрихованный квадрат в правом углу строки состояния), который можно увидеть на иллюстрациях ниже.

source: As entry keyboard shortcuts cannot change the database when used, unlike say a menu item shortcut that could delete an entry, as a safety measure, entry keyboard shortcuts take precedence over menu item shortcuts.
ru_ru: Т. к. использование комбинации клавиш связанных с элементами контейнера не изменяет сам контейнер (в отличие от комбинаций для пунктов меню, которые могу быть назначены на удаление элемента), горячим клавишам для элементов был дан более высокий приоритет в случае конфликта.

source: As in the Text Export option, you can control what entries and field to export to the XML file by clicking on the Advanced button in the Export XML dialog box.
ru_ru: Как и в настройках экспорта в простой текст, вы можете указать поля для экспорта и сделать отбор по содержимому поставив флажок «Расширенные условия отбора».

source: As in the Text Export option, you can control what entries and field to export to the XML file by selecting the "Advanced field selection".
ru_ru: Как и в настройках экспорта в простой текст, вы можете указать поля для экспорта и сделать отбор по содержимому поставив флажок «Расширенные условия отбора».

source: As in the main Tree view, the title field has a '#' appended to its value if the entry is protected.
ru_ru: Как и в основном списке, защищённый элемент помечается символом «#».

source: As indicated above, the alias' "password" is in the form [g:t:u] but in fact you only have to specify enough information to uniquely identify the base entry.
ru_ru: Из описанного следует, что «пароль» для псевдонима имеет вид [g:t:u] (g – «группа», t – «заголовок», u – «имя пользователя»). При этом достаточно указать только ту информацию, по которой можно однозначно определить элемент.

source: As long as entries are not saved, they will be shown highlighted.
ru_ru: Изменённый элемент до момента сохранения будет выделен цветом.

source: As long as there is a matching unique entry, any of the following formats are accepted: [g:t:u], [g:t], [t:u] or [t].
ru_ru: Допускается любой из вариантов записи [g:t:u], [g:t], [t:u] или [t], если от указывает на единственный существует элемент.

source: As long as there is a unique entry that fits the information provided, any of the following formats are accepted: [g:t:u], [g:t], [t:u] or [t].
ru_ru: Допустимы следующие уникальные комбинации: [g:t:u], [g:t], [t:u] или [t].

source: As of this release, this information is split into database-specific and user/machine specific settings, with the latter being stored in a separate configuration file.
ru_ru: Начиная с версии 3.05 настройки были разбиты на две группы: связанных с контейнером (хранятся в контейнере) и связанные с пользователем/машиной (хранятся в отдельном файле настроек).

source: As part of the clearing process, the undo/redo log is also erased, as this may also contain sensitive information.
ru_ru: При очистке памяти удаляется и журнал отката/повтора действий, т. к. он может содержать защищаемую информацию.

source: As this only displays the data and will not alter it, you will still be able to import it into Password Safe at some later time.
ru_ru: Так как стилевой файл лишь задаёт отображение данных, а не изменяет их, его содержимое не влияет на импорт из XML-файла в контейнер Password Safe.

source: As we use XML to save these valies, field names are case sensitive.
ru_ru: Т. к. используется XML-формат, имена полей чувствительны к регистру.

source: As we use XML to save these values, field names are case sensitive.
ru_ru: Т. к. используется XML-формат, имена полей чувствительны к регистру.

source: As with all data important to you, you should backup your data to another media regularly.
ru_ru: Поэтому необходимо регулярно делать резервные копии важных данных на другие носители.

source: As you can see, each Filter consists of one or more rows, where each row defines a criteria on a given field.
ru_ru: Каждый фильтр состоит из одной или нескольких строк, каждая из которых описывает условие для указанного поля.

source: As you can see, the filters can be arbitrarily complex.
ru_ru: Как видно из примеров, фильтры могут быть различной сложности.

source: Ask user each time they add an entry whether to use the Username for all new entries
ru_ru: При создании нового элемента запрашивать установку имени пользователя по умолчанию

source: At any time after this, the user may double-click on that part of the Status Bar to switch between these two modes or use a menu item on the "File" menu.
ru_ru: В любой момент времени можно дважды щёлкнуть на этом сегменте строки состояния и переключить режим. Также это можно сделать через меню «Файл».

source: At the end of the import process, a small dialog box appears showing how many entries were added, and how many (if any) were unsuccessfully parsed.
ru_ru: По окончанию процесса импорта будет выведен диалог с информацией о количестве ошибок и успешно импортированных элементов.

source: Auto Save Changes
ru_ru: Автоматическое сохранение изменений

source: Auto Type
ru_ru: Автонабор

source: AutoType
ru_ru: Автонабор

source: AutoType of a shortcut uses the AutoType string of its base entry.
ru_ru: При выполнении автонабора для ярлыка используется последовательность из исходного элемента.

source: AutoType.
ru_ru: Автонабор.

source: Automatic Failsafe Backups
ru_ru: Аварийные резервные копии

source: Automatic Intermediate Backups
ru_ru: Промежуточные резервные копии

source: Automatically input user name and password into the selected input field.
ru_ru: Автоматически вводит имя пользователя и пароль в выбранные поля.

source: Autotype
ru_ru: Автонабор

source: B", then one can specify an alias to the latter by "[Dept.
ru_ru: B», тогда первый определяется сочетанием «[Отдел

source: BCC - followed by addresses to be included in the "bcc" (blind carbon copy) section of the message.
ru_ru: BCC — значение, указанное после знака «=», будет помещено в поле «BCC» (скрытая копия) сообщения.

source: Backing Up and Restoring Databases
ru_ru: Резервное копирование и восстановление контейнеров

source: Backspace
ru_ru: Забой (Backspace)

source: Backspace {BACKSPACE}, {BS} or {BKSP}
ru_ru: Забой {BACKSPACE}, {BS} или {BKSP}

source: Backup
ru_ru: Резервные копии

source: Backup (failsafe)
ru_ru: Аварийная резервная копия

source: Backup Directory
ru_ru: Каталог для резервных копий

source: Backup Name
ru_ru: Имя для резервной копии

source: Backup Options
ru_ru: Настройки резервного копирования

source: Backup Tab
ru_ru: Вкладка «Резервные копии»

source: Backup directory
ru_ru: Каталог для резервных копий

source: Backup name
ru_ru: Имя для резервной копии

source: Backups (intermediate)
ru_ru: Промежуточная резервная копия
